{
  "common": {
    "see-more": "See more information",
    "required-field": "Required field.",
    "email-field": "This field must be an valid email."
  },
  "home-page": {
    "these": "these.",
    "first": {
      "title": "Build your <gradient>business</gradient> with us!",
      "mayom": {
        "title": "MAYOM",
        "description": "MAYOM (MAnage Your Own Money) is a Financial Management System, that will help you control your expenses and grow your capital."
      },
      "web-development": {
        "title": "Web Development",
        "description": "If you don't have a website or want to improve the current visual of it, make it with us! Our web development uses the latests front-end technologies to make websites look modern and just the way that you want."
      },
      "web-api": {
        "title": "Web APIs",
        "description": "We develop web services to be consumed by your website, blog or application to consume, this makes your work easier giving you more time to focus on important tasks!"
      },
      "freelance": {
        "title": "Freelance",
        "description": "We can do works that meet your needs, if you want a big or small part of your project done by other entity so you can focus on activities more important for yourself, please contact us!"
      }
    },
    "second": {
      "title": "The <gradient>technologies</gradient> we use!",
      "front-end": {
        "title": "Front End",
        "description": "For the website looks, we use the latest technologies being used in the business that brings a modern, minimalistic and flexible design. Here are some of the technologies used:",
        "items": [
          {
            "name": "React",
            "description": "A JavaScript library that makes web development faster and easier with interactivity."
          },
          {
            "name": "Tailwind CSS",
            "description": "A utility-based CSS framework, makes the website development more simple, pretty and modern."
          },
          {
            "name": "Expo",
            "description": "Expo and EAS (Expo Application Service) are an ecosystem of tools that brings more speed and eficiency to mobile apps development."
          }
        ],
        "conclusion": "Besides an amazing look, your website or mobile app will have a high performance and will satisfy your needs."
      },
      "back-end": {
        "title": "Back End",
        "description": "If your website, blog or application needs a dedicated service, we work with the necessary technologies to meet your needs:",
        "items": [
          {
            "name": ".NET",
            "description": "The free cross-platform C# framework to build services with a fast response."
          },
          {
            "name": "MongoDB",
            "description": "The most used NoSQL database in the world, with an architecture based on documents and high eficiency and flexibility."
          },
          {
            "name": "SQL Server",
            "description": "The most famous and used relational database, with an amazing performance on data work."
          }
        ],
        "conclusion": "For a servicewhat matters is the effectiveness, response speed, escalability and flexibility, but this differs for each service and each technology must be chosed to meet what the service needs to do."
      },
      "used-techs-web-dev": "For web development we use ",
      "used-techs-web-api": "For Web APIs we use "
    }
  },
  "services": {
    "title": "Digital Innovation Tailored for Your Success!",
    "description": "Welcome to <gradient>Lógica Colossal</gradient>! We are a passionate team for technology, dedicate to transform your ideas in digital robust solutions, escalable and with focus on the user experience. We understand that each business is unique, therefore, we offer software development services customized to boost your growth.",
    "services-intro": "We combine the power and versatility of cutting-edge technologies to deliver complete and efficient solutions, here is what we can do for you:",
    "web-development": {
      "title": "Web Development",
      "description": "We build modern and dynamic web applications, with a safe and robust back-end in and interactive and performative user interface. Be it e-commerce, a complex management system or an intuitive information platform, our expertise ensure a excepcional online experience for your users and clients."
    },
    "web-apis": {
      "title": "Web APIs",
      "description": "We integrate systems and data intelligently and securely through the development of customized APIs. We create efficient bridges between your applications, enabling fluid communication and process optimization, whether for internal integration or to offer services to partners and customers."
    },
    "mobile-app": {
      "title": "Mobile Application Development",
      "description": "We bring your brand and services to the palm of your customers' hands. We develop native applications for Android and iOS, with intuitive interfaces, innovative features and a focus on security, ensuring the satisfaction of your mobile users."
    },
    "freelance": {
      "title": "Freelance",
      "description": "With focus on quality, performance and delivering within the deadline, we can make anything that you want regarding software development, get in touch with us and let's talk about your ideas and how we can turn them into digital reality."
    },
    "conclusion": {
      "title": "Let's turn your vision into digital reality?",
      "description": "Get in touch with us e find out how <gradient>Lógica Colossal</gradient> can boost your business with innovative and tailored system development solutions. We can't wait to hear about your new project!"
    },
    "contact-form": "Send Us a Message"
  },
  "web-development": {
    "title": "Custom Web Development That Moves Business Forward",
    "description": "At <gradient>Lógica Colossal</gradient>, we engineer high-performance digital experiences. Whether you're a startup looking to make your mark or an enterprise scaling your digital footprint, our expert web developers bring your vision to life with clean code, seamless UX, and scalable architecture.",
    "what-we-deliver": {
      "title": "What We Deliver",
      "custom-web-apps": {
        "title": "Custom Web Applications",
        "description": "From concept to code, we develop robust, secure, and responsive web apps tailored to your business goals."
      },
      "responsive": {
        "title": "Responsive Design",
        "description": "We ensure every experience is optimized across devices, from smartphones to desktops."
      },
      "user-centric": {
        "title": "User-Centric UI/UX",
        "description": "Design that doesn’t just look good—but works beautifully for your users."
      },
      "security-performance": {
        "title": "Security & Performance",
        "description": "Your site will be fast, reliable, and protected with the latest security best practices."
      }
    },
    "conclusion": {
      "title": "Ready to Build What’s Next?",
      "description": "Partner with a team that understands the tech and the business. Let’s create something remarkable together. Get in touch with us through our contacts or the contact form."
    }
  },
  "contact-us": {
    "title": "Contact Us",
    "description": "We’re here to turn your ideas into powerful digital solutions. Whether you're looking to build a custom application, scale your existing systems, or want to talk about our services, our team is ready to help. Reach out and let's start the conversation.",
    "form": {
      "title": "Work with Us",
      "name": "Name",
      "company": "Company Name",
      "email": "Email",
      "message": "Message",
      "submit": "Send"
    }
  },
  "navbar": {
    "contact-us": "Contacts",
    "services": {
      "title": "Services",
      "web-development": {
        "title": "Web Development",
        "description": "Do you want a website specific to promote and display your business? Check out this section to know more about <b>SPA</b> and how it can help your business grow!"
      },
      "web-api": {
        "title": "Web APIs",
        "description": "If you have a website, blog or application and want a dedicated service, do it with us!"
      },
      "freelance": {
        "title": "Freelance",
        "description": "We are able to perform many tasks within the technologies used, for both Front End and Back End."
      }
    }
  },
  "footer": {
    "title": "Let's turn your ideia into reality, get in touch with us!",
    "send-message": "Send Message",
    "contacts": {
      "title": "Contacts"
    },
    "web-development": "Web Development",
    "dotnet-services": ".NET Services",
    "mobile-app-development": "Mobile Applications Development",
    "website": "Website",
    "web-apis": "Web APIs",
    "freelance": "Freelance",
    "all-rights-reserved": "All rights reserved",
    "privacy-policy": "Privacy Policy"
  }
}
